# For imports:


if __name__=="__main__":
    # Стадия 1:
    # TODO: Попробовать через библиотеку requests сходить в АПИ бесплатной погоды и получить JSON словарик ответ данных для Санкт Петербурга, 
        # посмотреть на него, порадоваться и скинуть скрин в беседу в ТГ.
    # TODO: Из той инфы, которую выдаст погода, забрать температуру градусов цельсия, пройдясь по python словарику, 
        # и сохранить ее в переменную пока.
    # TODO: Со своего ТГ аккаунту начать чат с созданным ботом.
    # TODO: Выяснить свой chat_id в телеге доступными сейчас современными способами, погуглив их 
        # (вроде был бот, которому ты пишешь, а он тебе в ответ айдишник)
        # либо ты после того как начинаешь чат с ботом, ищещь апи ендпоинт, по которому можно обновления бота посмотреть, 
        # там в урле будет слово "updates" и смотришь, собираешь урл со своим токеном, смотришь в бразуере с компа, че там нового буедт на страничке, 
        # в JSONке на траническ увидешь первое сообщение от своего тг акка боту и там же chat_id
    # TODO: Возможно поиск новых айди можно автоматизировать, велкам!
    # TODO: Написать с бота человеку с погодой!
    
    # Стадия 2:
    # TODO: Нужен while True цикл, в котором ты проверяешь, что сейчас 8 утра.
    # TODO: Собиарешь погоду по Питеру.
    # TODO: Шлешь тем людям, кто ботом начал пользоваться.

    # Стадия 3:
    # TODO: Узнать как правильно ботом реагировать на новые сообщения от пользователей.
    # TODO: Хранить больше инфы об типах (как к нему обращаться вежливо, какой город, в какое время, какое часовой пояс, может даже он несколько локаций)
    # TODO: Tiny DB, можно постоянно читать и писать в JSON файлик (попробовать сделать настоящую реаляционную SQL бд с табличками, в идеале докер файл и мочь коннектиться к БД внутри контейнера)

